# Import and read

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/dayanandv/Data-Science/main/dataset/property%20data.csv')
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

# Check for null values

# Replace wrong category of data in columns

# Summary stats of missing data

# Replacing missing values in the whole dataframe

# Dropping NaN values

# Imputation using sklearn SimpleImputer
Strategy argument can take the values – ‘mean'(default), ‘median’, ‘most_frequent’ and ‘constant’

In [8]:
dataset = pd.read_csv('https://raw.githubusercontent.com/dayanandv/Data-Science/main/dataset/pima-indians-diabetes.csv')
dataset

      N  PGC  DBP  TSFT  2HSI   BMI    DPF  Age  Class
0     6  148   72    35     0  33.6  0.627   50      1
1     1   85   66    29     0  26.6  0.351   31      0
2     8  183   64     0     0  23.3  0.672   32      1
3     1   89   66    23    94  28.1  0.167   21      0
4     0  137   40    35   168  43.1  2.288   33      1
..   ..  ...  ...   ...   ...   ...    ...  ...    ...
763  10  101   76    48   180  32.9  0.171   63      0
764   2  122   70    27     0  36.8  0.340   27      0
765   5  121   72    23   112  26.2  0.245   30      0
766   1  126   60     0     0  30.1  0.349   47      1
767   1   93   70    31     0  30.4  0.315   23      0

[768 rows x 9 columns]

Replace all '0's in the first five columns with nan

Replace all nan with column's mean